evidencias-pruebas/artillery-output.txt
npm warn deprecated whatwg-encoding@3.1.1: Use @exodus/bytes instead for a more spec-conformant and faster implementation
npm warn deprecated prom-client@14.2.0: prom-client has been replaced by @prometheus-io/client
Test run id: twj94_gtwqb6tzmqfc7j5pykhfen4rz88me_m4ta
Phase started: 1. 🧪 Fase de Calentamiento (Tráfico Base) (index: 0, duration: 20s) 19:20:04(-0500)

Phase completed: 1. 🧪 Fase de Calentamiento (Tráfico Base) (index: 0, duration: 20s) 19:20:24(-0500)

Phase started: 2. 🧪 Fase de Saturación Máxima (Pico de Carga) (index: 1, duration: 30s) 19:20:24(-0500)

--------------------------------------
Metrics for period to: 19:20:10(-0500) (width: 4.158s)
--------------------------------------

http.codes.201: ................................................................ 24
http.codes.400: ................................................................ 18
http.downloaded_bytes: ......................................................... 10104
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 42
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 39
  mean: ........................................................................ 5.6
  median: ...................................................................... 3
  p95: ......................................................................... 18
  p99: ......................................................................... 24.8
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 39
  mean: ........................................................................ 8
  median: ...................................................................... 5
  p95: ......................................................................... 18
  p99: ......................................................................... 24.8
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 21
  mean: ........................................................................ 2.5
  median: ...................................................................... 1
  p95: ......................................................................... 5
  p99: ......................................................................... 5
http.responses: ................................................................ 42
vusers.completed: .............................................................. 18
vusers.created: ................................................................ 24
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  24
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1007.6
  max: ......................................................................... 1047.2
  mean: ........................................................................ 1018.9
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 19:20:20(-0500) (width: 9.961s)
--------------------------------------

http.codes.201: ................................................................ 50
http.codes.400: ................................................................ 51
http.downloaded_bytes: ......................................................... 24560
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 101
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 12
  mean: ........................................................................ 2.7
  median: ...................................................................... 2
  p95: ......................................................................... 7.9
  p99: ......................................................................... 12.1
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 12
  mean: ........................................................................ 4.7
  median: ...................................................................... 3
  p95: ......................................................................... 8.9
  p99: ......................................................................... 12.1
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 3
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 101
vusers.completed: .............................................................. 51
vusers.created: ................................................................ 50
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1005.1
  max: ......................................................................... 1053.6
  mean: ........................................................................ 1010.3
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


--------------------------------------
Metrics for period to: 19:20:30(-0500) (width: 9.958s)
--------------------------------------

http.codes.201: ................................................................ 108
http.codes.400: ................................................................ 93
http.downloaded_bytes: ......................................................... 48588
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 201
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 46
  mean: ........................................................................ 3.3
  median: ...................................................................... 2
  p95: ......................................................................... 10.1
  p99: ......................................................................... 18
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 46
  mean: ........................................................................ 5.5
  median: ...................................................................... 4
  p95: ......................................................................... 12.1
  p99: ......................................................................... 18
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 3
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 2
http.responses: ................................................................ 201
vusers.completed: .............................................................. 93
vusers.created: ................................................................ 108
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  108
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1004.1
  max: ......................................................................... 1051.3
  mean: ........................................................................ 1010.8
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 19:20:40(-0500) (width: 9.963s)
--------------------------------------

http.codes.201: ................................................................ 264
http.codes.400: ................................................................ 252
http.downloaded_bytes: ......................................................... 125184
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 516
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 28
  mean: ........................................................................ 2.8
  median: ...................................................................... 2
  p95: ......................................................................... 8.9
  p99: ......................................................................... 13.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 28
  mean: ........................................................................ 4.7
  median: ...................................................................... 4
  p95: ......................................................................... 10.9
  p99: ......................................................................... 16
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 6
http.responses: ................................................................ 516
vusers.completed: .............................................................. 252
vusers.created: ................................................................ 264
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  264
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1003.6
  max: ......................................................................... 1050.7
  mean: ........................................................................ 1009.7
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


Phase completed: 2. 🧪 Fase de Saturación Máxima (Pico de Carga) (index: 1, duration: 30s) 19:20:54(-0500)

--------------------------------------
Metrics for period to: 19:20:50(-0500) (width: 9.966s)
--------------------------------------

http.codes.201: ................................................................ 384
http.codes.400: ................................................................ 373
http.downloaded_bytes: ......................................................... 183764
http.request_rate: ............................................................. 79/sec
http.requests: ................................................................. 759
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 43
  mean: ........................................................................ 2.7
  median: ...................................................................... 2
  p95: ......................................................................... 7.9
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 43
  mean: ........................................................................ 4.6
  median: ...................................................................... 3
  p95: ......................................................................... 10.1
  p99: ......................................................................... 23.8
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 7
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 6
http.responses: ................................................................ 757
vusers.completed: .............................................................. 373
vusers.created: ................................................................ 386
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  386
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1002.9
  max: ......................................................................... 1051
  mean: ........................................................................ 1009
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 19:21:00(-0500) (width: 6.265s)
--------------------------------------

http.codes.201: ................................................................ 245
http.codes.400: ................................................................ 288
http.downloaded_bytes: ......................................................... 130250
http.request_rate: ............................................................. 88/sec
http.requests: ................................................................. 531
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 15
  mean: ........................................................................ 2.3
  median: ...................................................................... 1
  p95: ......................................................................... 7.9
  p99: ......................................................................... 10.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 15
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 12.1
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 7
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 4
http.responses: ................................................................ 533
vusers.completed: .............................................................. 288
vusers.created: ................................................................ 243
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  243
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1003
  max: ......................................................................... 1033.8
  mean: ........................................................................ 1008.9
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


All VUs finished. Total time: 52 seconds

--------------------------------
Summary report @ 19:20:58(-0500)
--------------------------------

http.codes.201: ................................................................ 1075
http.codes.400: ................................................................ 1075
http.downloaded_bytes: ......................................................... 522450
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 2150
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 46
  mean: ........................................................................ 2.7
  median: ...................................................................... 2
  p95: ......................................................................... 7.9
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 46
  mean: ........................................................................ 4.7
  median: ...................................................................... 4
  p95: ......................................................................... 10.9
  p99: ......................................................................... 21.1
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 21
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 6
http.responses: ................................................................ 2150
vusers.completed: .............................................................. 1075
vusers.created: ................................................................ 1075
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  1075
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1002.9
  max: ......................................................................... 1053.6
  mean: ........................................................................ 1009.5
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3
Log file: artillery-report.json

Checks:
ok: maxErrorRate < 1
ok: http.response_time.p99 < 200